<?xml version="1.0"?>
<net name="runtime_gpu_graph" version="11">
	<layers>
		<layer id="0" name="state_update_mode" type="Input">
			<data shape="1" element_type="i32" execOrder="0" execTimeMcs="not_executed" originalLayersNames="state_update_mode" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="wait_for_events__i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="position_ids" type="Input">
			<data shape="3,?,?" element_type="i64" execOrder="1" execTimeMcs="not_executed" originalLayersNames="position_ids" outputLayouts="bfyx" outputPrecisions="i64" primitiveType="wait_for_events__i64" runtimePrecision="i64" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_ids" type="Input">
			<data shape="?,?" element_type="i64" execOrder="3" execTimeMcs="not_executed" originalLayersNames="input_ids" outputLayouts="bfyx" outputPrecisions="i64" primitiveType="wait_for_events__i64" runtimePrecision="i64" />
			<output>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="beam_idx" type="Input">
			<data shape="?" element_type="i32" execOrder="6" execTimeMcs="not_executed" originalLayersNames="beam_idx" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="wait_for_events__i32" runtimePrecision="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="attention_mask" type="Input">
			<data shape="?,?" element_type="i64" execOrder="7" execTimeMcs="not_executed" originalLayersNames="attention_mask" outputLayouts="bfyx" outputPrecisions="i64" primitiveType="wait_for_events__i64" runtimePrecision="i64" />
			<output>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Convert_4461" type="Reorder">
			<data execOrder="4" execTimeMcs="not_executed" originalLayersNames="Convert_4461" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="reorder_data__i64" runtimePrecision="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Gather_4463" type="Gather">
			<data execOrder="199" execTimeMcs="not_executed" originalLayersNames="Gather_4463,Multiply_97256" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="gather_ref__u8" runtimePrecision="u8" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Convert_78036" type="Reorder">
			<data execOrder="8" execTimeMcs="not_executed" originalLayersNames="Convert_78036" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="reorder_data__i64" runtimePrecision="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="ShapeOf_65900" type="shape_of">
			<data execOrder="9" execTimeMcs="not_executed" originalLayersNames="ShapeOf_65900" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="shape_of_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Gather_65903" type="Gather">
			<data execOrder="101" execTimeMcs="not_executed" originalLayersNames="Gather_65903" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="gather_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="ShapeOf_65906" type="shape_of">
			<data execOrder="5" execTimeMcs="not_executed" originalLayersNames="ShapeOf_65906" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="shape_of_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Gather_65909" type="Gather">
			<data execOrder="97" execTimeMcs="not_executed" originalLayersNames="Gather_65909" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="gather_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Multiply_95746" type="Eltwise">
			<data execOrder="100" execTimeMcs="not_executed" originalLayersNames="Multiply_95746" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="eltwise_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Subtract_4799" type="Eltwise">
			<data execOrder="105" execTimeMcs="not_executed" originalLayersNames="Subtract_4799" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="eltwise_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ScatterUpdate_49275" type="scatter_update">
			<data execOrder="147" execTimeMcs="not_executed" originalLayersNames="ScatterUpdate_49275" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="scatter_update_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="ScatterUpdate_49277" type="scatter_update">
			<data execOrder="146" execTimeMcs="not_executed" originalLayersNames="ScatterUpdate_49277" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="scatter_update_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Slice_4800" type="StridedSlice">
			<data execOrder="148" execTimeMcs="not_executed" originalLayersNames="Slice_4800" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="strided_slice_ref__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Convert_4870" type="Reorder">
			<data execOrder="149" execTimeMcs="not_executed" originalLayersNames="Convert_4870" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Unsqueeze_4871" type="Reshape">
			<data execOrder="150" execTimeMcs="not_executed" originalLayersNames="Unsqueeze_4871" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="6" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="7" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="8" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="9" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="10" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="11" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="12" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="13" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="14" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="15" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="16" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="17" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="18" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="19" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="20" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="21" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="22" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="23" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="24" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="RMS_4869" type="rms">
			<data execOrder="983" execTimeMcs="not_executed" originalLayersNames="RMS_4869,Multiply_4872,MatMul_4873_scale_down" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="6" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="DynamicQuantize_115497" type="DynamicQuantize">
			<data execOrder="1000" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115497" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="MatMul_4873" type="FullyConnected">
			<data execOrder="1001" execTimeMcs="not_executed" originalLayersNames="MatMul_4873,Multiply_102485" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Transpose_4880" type="Permute">
			<data execOrder="1002" execTimeMcs="not_executed" originalLayersNames="Transpose_4880" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="ShapeOf_65914" type="shape_of">
			<data execOrder="984" execTimeMcs="not_executed" originalLayersNames="ShapeOf_65914" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="shape_of_cpu_impl__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Gather_65917" type="Gather">
			<data execOrder="985" execTimeMcs="not_executed" originalLayersNames="Gather_65917" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="gather_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Concat_4887" type="Concat">
			<data execOrder="988" execTimeMcs="not_executed" originalLayersNames="Concat_4887" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="concatenation_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Broadcast_4889" type="broadcast">
			<data execOrder="989" execTimeMcs="not_executed" originalLayersNames="Broadcast_4889" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="broadcast_cpu_impl__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="FusedConv_4894" type="fused_conv">
			<data execOrder="1003" execTimeMcs="not_executed" originalLayersNames="FusedConv_4894" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl::fused_conv::ref___f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>4</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="snapshot.linear_states.0.conv" type="Reorder">
			<data execOrder="2288" execTimeMcs="not_executed" originalLayersNames="snapshot.linear_states.0.conv" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>8192</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Transpose_4895" type="Permute">
			<data execOrder="1004" execTimeMcs="not_executed" originalLayersNames="Transpose_4895" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Slice_4897" type="StridedSlice">
			<data execOrder="1009" execTimeMcs="not_executed" originalLayersNames="Slice_4897" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="strided_slice_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_4902" type="Reshape">
			<data execOrder="1010" execTimeMcs="not_executed" originalLayersNames="Reshape_4902" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Slice_4899" type="StridedSlice">
			<data execOrder="1007" execTimeMcs="not_executed" originalLayersNames="Slice_4899" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="strided_slice_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_4903" type="Reshape">
			<data execOrder="1008" execTimeMcs="not_executed" originalLayersNames="Reshape_4903" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Slice_4900" type="StridedSlice">
			<data execOrder="1005" execTimeMcs="not_executed" originalLayersNames="Slice_4900" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="strided_slice_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_4904" type="Reshape">
			<data execOrder="1006" execTimeMcs="not_executed" originalLayersNames="Reshape_4904" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="DynamicQuantize_115503" type="DynamicQuantize">
			<data execOrder="996" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115503" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="MatMul_4876" type="FullyConnected">
			<data execOrder="997" execTimeMcs="not_executed" originalLayersNames="MatMul_4876,Add_4907,MatMul_4876_scale_up" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="SoftPlus_4908" type="Activation">
			<data execOrder="998" execTimeMcs="not_executed" originalLayersNames="SoftPlus_4908" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="activation_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Negative_4911" type="Eltwise">
			<data execOrder="999" execTimeMcs="not_executed" originalLayersNames="Negative_4911" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="DynamicQuantize_115509" type="DynamicQuantize">
			<data execOrder="994" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115509" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MatMul_4875" type="FullyConnected">
			<data execOrder="995" execTimeMcs="not_executed" originalLayersNames="MatMul_4875,MatMul_4875_scale_up,Sigmoid_4906" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Concat_4914" type="Concat">
			<data execOrder="986" execTimeMcs="not_executed" originalLayersNames="Concat_4914" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="concatenation_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Broadcast_4916" type="broadcast">
			<data execOrder="987" execTimeMcs="not_executed" originalLayersNames="Broadcast_4916" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="broadcast_cpu_impl__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="LinearAttention_4919" type="linear_attention">
			<data execOrder="1011" execTimeMcs="not_executed" originalLayersNames="LinearAttention_4919" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl::linear_attention::ref___f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="6" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="8" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="snapshot.linear_states.0.recurrent" type="Reorder">
			<data execOrder="2287" execTimeMcs="not_executed" originalLayersNames="snapshot.linear_states.0.recurrent" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="reorder_data__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="DynamicQuantize_115515" type="DynamicQuantize">
			<data execOrder="990" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115515" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="MatMul_4874" type="FullyConnected">
			<data execOrder="991" execTimeMcs="not_executed" originalLayersNames="MatMul_4874,Multiply_102490" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Reshape_4878" type="Reshape">
			<data execOrder="992" execTimeMcs="not_executed" originalLayersNames="Reshape_4878" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Swish_4928" type="Activation">
			<data execOrder="993" execTimeMcs="not_executed" originalLayersNames="Swish_4928" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="activation_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Multiply_4929" type="rms">
			<data execOrder="1012" execTimeMcs="not_executed" originalLayersNames="Multiply_4929,Multiply_4930,Multiply_102495" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Reshape_4932" type="Reshape">
			<data execOrder="1013" execTimeMcs="not_executed" originalLayersNames="Reshape_4932" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="DynamicQuantize_115521" type="DynamicQuantize">
			<data execOrder="1014" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115521" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="MatMul_4933" type="FullyConnected">
			<data execOrder="1015" execTimeMcs="not_executed" originalLayersNames="MatMul_4933,Add_4934" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="RMS_4936" type="rms">
			<data execOrder="1016" execTimeMcs="not_executed" originalLayersNames="RMS_4936,MatMul_4937_scale_down" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="DynamicQuantize_115527" type="DynamicQuantize">
			<data execOrder="1019" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115527" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="DynamicQuantize_115533" type="DynamicQuantize">
			<data execOrder="1017" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115533" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="MatMul_4938" type="FullyConnected">
			<data execOrder="1018" execTimeMcs="not_executed" originalLayersNames="MatMul_4938" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="MatMul_4937" type="FullyConnected">
			<data execOrder="1020" execTimeMcs="not_executed" originalLayersNames="MatMul_4937,MatMul_4937_scale_up,Swish_4939,Multiply_4940_mm" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="DynamicQuantize_115539" type="DynamicQuantize">
			<data execOrder="1021" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115539" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="MatMul_4941" type="FullyConnected">
			<data execOrder="1022" execTimeMcs="not_executed" originalLayersNames="MatMul_4941,Add_4942" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9216</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="RMS_4944" type="rms">
			<data execOrder="1023" execTimeMcs="not_executed" originalLayersNames="RMS_4944,Multiply_4947,MatMul_4948_scale_down" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="6" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="DynamicQuantize_115545" type="DynamicQuantize">
			<data execOrder="1040" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115545" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="MatMul_4948" type="FullyConnected">
			<data execOrder="1041" execTimeMcs="not_executed" originalLayersNames="MatMul_4948,Multiply_102500" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Transpose_4953" type="Permute">
			<data execOrder="1042" execTimeMcs="not_executed" originalLayersNames="Transpose_4953" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="ShapeOf_65924" type="shape_of">
			<data execOrder="1024" execTimeMcs="not_executed" originalLayersNames="ShapeOf_65924" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="shape_of_cpu_impl__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Gather_65927" type="Gather">
			<data execOrder="1025" execTimeMcs="not_executed" originalLayersNames="Gather_65927" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="gather_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Concat_4958" type="Concat">
			<data execOrder="1028" execTimeMcs="not_executed" originalLayersNames="Concat_4958" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="concatenation_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Broadcast_4960" type="broadcast">
			<data execOrder="1029" execTimeMcs="not_executed" originalLayersNames="Broadcast_4960" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="broadcast_cpu_impl__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="FusedConv_4964" type="fused_conv">
			<data execOrder="1043" execTimeMcs="not_executed" originalLayersNames="FusedConv_4964" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl::fused_conv::ref___f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>4</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="snapshot.linear_states.1.conv" type="Reorder">
			<data execOrder="2286" execTimeMcs="not_executed" originalLayersNames="snapshot.linear_states.1.conv" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>8192</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Transpose_4965" type="Permute">
			<data execOrder="1044" execTimeMcs="not_executed" originalLayersNames="Transpose_4965" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Slice_4966" type="StridedSlice">
			<data execOrder="1049" execTimeMcs="not_executed" originalLayersNames="Slice_4966" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="strided_slice_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Reshape_4969" type="Reshape">
			<data execOrder="1050" execTimeMcs="not_executed" originalLayersNames="Reshape_4969" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Slice_4967" type="StridedSlice">
			<data execOrder="1047" execTimeMcs="not_executed" originalLayersNames="Slice_4967" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="strided_slice_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_4970" type="Reshape">
			<data execOrder="1048" execTimeMcs="not_executed" originalLayersNames="Reshape_4970" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Slice_4968" type="StridedSlice">
			<data execOrder="1045" execTimeMcs="not_executed" originalLayersNames="Slice_4968" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="strided_slice_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Reshape_4971" type="Reshape">
			<data execOrder="1046" execTimeMcs="not_executed" originalLayersNames="Reshape_4971" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="DynamicQuantize_115551" type="DynamicQuantize">
			<data execOrder="1036" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_115551" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="MatMul_4951" type="FullyConnected">
			<data execOrder="1037" execTimeMcs="not_executed" originalLayersNames="MatMul_4951,Add_4973,MatMul_4951_scale_up" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="SoftPlus_4974" type="Activation">
			<data execOrder="1038" execTimeMcs="not_executed" originalLayersNames="SoftPlus_4974" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="activation_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
				</port>
