<?xml version="1.0"?>
<net name="runtime_gpu_graph" version="11">
	<layers>
		<layer id="0" name="target_hidden" type="Input">
			<data shape="?,?,12800" element_type="f32" execOrder="0" execTimeMcs="not_executed" originalLayersNames="target_hidden" outputLayouts="bfyx" outputPrecisions="f32" primitiveType="wait_for_events__f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12800</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="position_ids" type="Input">
			<data shape="?,?" element_type="i64" execOrder="1" execTimeMcs="not_executed" originalLayersNames="position_ids" outputLayouts="bfyx" outputPrecisions="i64" primitiveType="wait_for_events__i64" runtimePrecision="i64" />
			<output>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_ids" type="Input">
			<data shape="?,?" element_type="i64" execOrder="2" execTimeMcs="not_executed" originalLayersNames="input_ids" outputLayouts="bfyx" outputPrecisions="i64" primitiveType="wait_for_events__i64" runtimePrecision="i64" />
			<output>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Convert_7638" type="Reorder">
			<data execOrder="151" execTimeMcs="not_executed" originalLayersNames="Convert_7638" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="reorder_data__i64" runtimePrecision="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Gather_7640" type="Gather">
			<data execOrder="154" execTimeMcs="not_executed" originalLayersNames="Gather_7640,Multiply_137221" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="gather_ref__u8" runtimePrecision="u8" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="RMS_7652" type="rms">
			<data execOrder="160" execTimeMcs="not_executed" originalLayersNames="RMS_7652" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="MatMul_7654_scale_down" type="Eltwise">
			<data execOrder="165" execTimeMcs="not_executed" originalLayersNames="MatMul_7654_scale_down" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="DynamicQuantize_140070" type="DynamicQuantize">
			<data execOrder="169" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_140070" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="MatMul_7654" type="FullyConnected">
			<data execOrder="173" execTimeMcs="not_executed" originalLayersNames="MatMul_7654" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_7658" type="Reshape">
			<data execOrder="176" execTimeMcs="not_executed" originalLayersNames="Reshape_7658" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Transpose_7660" type="Permute">
			<data execOrder="180" execTimeMcs="not_executed" originalLayersNames="Transpose_7660" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="RMS_7666" type="rms">
			<data execOrder="184" execTimeMcs="not_executed" originalLayersNames="RMS_7666" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Convert_7646" type="Reorder">
			<data execOrder="150" execTimeMcs="not_executed" originalLayersNames="Convert_7646" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data__i64" runtimePrecision="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Unsqueeze_7648" type="Reshape">
			<data execOrder="153" execTimeMcs="not_executed" originalLayersNames="Unsqueeze_7648" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_7649" type="Eltwise">
			<data execOrder="156" execTimeMcs="not_executed" originalLayersNames="Multiply_7649" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Cos_7650" type="Activation">
			<data execOrder="159" execTimeMcs="not_executed" originalLayersNames="Cos_7650" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="activation_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="ShapeOf_131967" type="shape_of">
			<data execOrder="164" execTimeMcs="not_executed" originalLayersNames="ShapeOf_131967" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="shape_of_cpu_impl__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Gather_131970" type="Gather">
			<data execOrder="167" execTimeMcs="not_executed" originalLayersNames="Gather_131970" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="gather_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Squeeze_131971" type="Reshape">
			<data execOrder="171" execTimeMcs="not_executed" originalLayersNames="Squeeze_131971" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="undef" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="19" name="ShapeOf_131974" type="shape_of">
			<data execOrder="168" execTimeMcs="not_executed" originalLayersNames="ShapeOf_131974" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="shape_of_cpu_impl__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Gather_131977" type="Gather">
			<data execOrder="172" execTimeMcs="not_executed" originalLayersNames="Gather_131977" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="gather_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Multiply_136932" type="Eltwise">
			<data execOrder="179" execTimeMcs="not_executed" originalLayersNames="Multiply_136932" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="eltwise_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Squeeze_131978" type="Reshape">
			<data execOrder="183" execTimeMcs="not_executed" originalLayersNames="Squeeze_131978" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="undef" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" />
			</output>
		</layer>
		<layer id="23" name="Subtract_7679" type="Eltwise">
			<data execOrder="187" execTimeMcs="not_executed" originalLayersNames="Subtract_7679" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="eltwise_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="24" name="Range_7681" type="range">
			<data execOrder="191" execTimeMcs="not_executed" originalLayersNames="Range_7681" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="range_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Gather_7748" type="Gather">
			<data execOrder="194" execTimeMcs="not_executed" originalLayersNames="Gather_7748" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="gather_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Unsqueeze_7829" type="Reshape">
			<data execOrder="199" execTimeMcs="not_executed" originalLayersNames="Unsqueeze_7829" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Sin_7651" type="Activation">
			<data execOrder="158" execTimeMcs="not_executed" originalLayersNames="Sin_7651" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="activation_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Gather_7827" type="Gather">
			<data execOrder="193" execTimeMcs="not_executed" originalLayersNames="Gather_7827" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="gather_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Unsqueeze_7830" type="Reshape">
			<data execOrder="198" execTimeMcs="not_executed" originalLayersNames="Unsqueeze_7830" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="RoPE_7831" type="RoPE">
			<data execOrder="200" execTimeMcs="not_executed" originalLayersNames="RoPE_7831" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl::rope::opt___f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="MatMul_7641_scale_down" type="Eltwise">
			<data execOrder="152" execTimeMcs="not_executed" originalLayersNames="MatMul_7641_scale_down" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="generic_eltwise_ref__f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12800</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12800</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="DynamicQuantize_140076" type="DynamicQuantize">
			<data execOrder="155" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_140076" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12800</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12800</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12800</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="MatMul_7641" type="FullyConnected">
			<data execOrder="157" execTimeMcs="not_executed" originalLayersNames="MatMul_7641" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12800</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12800</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="RMS_7642" type="rms">
			<data execOrder="161" execTimeMcs="not_executed" originalLayersNames="RMS_7642" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Concat_7653" type="Concat">
			<data execOrder="166" execTimeMcs="not_executed" originalLayersNames="Concat_7653" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="concatenation_gpu_simple_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="MatMul_7655_scale_down" type="Eltwise">
			<data execOrder="170" execTimeMcs="not_executed" originalLayersNames="MatMul_7655_scale_down" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="DynamicQuantize_140082" type="DynamicQuantize">
			<data execOrder="175" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_140082" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="MatMul_7655" type="FullyConnected">
			<data execOrder="178" execTimeMcs="not_executed" originalLayersNames="MatMul_7655" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_7662" type="Reshape">
			<data execOrder="182" execTimeMcs="not_executed" originalLayersNames="Reshape_7662" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Transpose_7663" type="Permute">
			<data execOrder="186" execTimeMcs="not_executed" originalLayersNames="Transpose_7663" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="RMS_7667" type="rms">
			<data execOrder="190" execTimeMcs="not_executed" originalLayersNames="RMS_7667" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Unsqueeze_7832" type="Reshape">
			<data execOrder="163" execTimeMcs="not_executed" originalLayersNames="Unsqueeze_7832" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Unsqueeze_7833" type="Reshape">
			<data execOrder="162" execTimeMcs="not_executed" originalLayersNames="Unsqueeze_7833" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="RoPE_7834" type="RoPE">
			<data execOrder="192" execTimeMcs="not_executed" originalLayersNames="RoPE_7834" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl::rope::opt___f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Unsqueeze_7835" type="Reshape">
			<data execOrder="196" execTimeMcs="not_executed" originalLayersNames="Unsqueeze_7835" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="ShapeOf_131984" type="shape_of">
			<data execOrder="188" execTimeMcs="not_executed" originalLayersNames="ShapeOf_131984" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="shape_of_cpu_impl__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Gather_131987" type="Gather">
			<data execOrder="195" execTimeMcs="not_executed" originalLayersNames="Gather_131987" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="gather_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="ShapeOf_131988" type="shape_of">
			<data execOrder="197" execTimeMcs="not_executed" originalLayersNames="ShapeOf_131988" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="shape_of_cpu_impl__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Gather_131991" type="Gather">
			<data execOrder="201" execTimeMcs="not_executed" originalLayersNames="Gather_131991" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="gather_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Concat_7847" type="Concat">
			<data execOrder="202" execTimeMcs="not_executed" originalLayersNames="Concat_7847" outputLayouts="bfyx" outputPrecisions="i32" primitiveType="concatenation_cpu_impl__i32" runtimePrecision="i32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>5</dim>
				</port>
				<port id="3" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Broadcast_7848" type="broadcast">
			<data execOrder="204" execTimeMcs="not_executed" originalLayersNames="Broadcast_7848" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="broadcast_gpu_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_7853" type="Reshape">
			<data execOrder="205" execTimeMcs="not_executed" originalLayersNames="Reshape_7853" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="DynamicQuantize_140088" type="DynamicQuantize">
			<data execOrder="174" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_140088" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="MatMul_7656" type="FullyConnected">
			<data execOrder="177" execTimeMcs="not_executed" originalLayersNames="MatMul_7656" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Reshape_7664" type="Reshape">
			<data execOrder="181" execTimeMcs="not_executed" originalLayersNames="Reshape_7664" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Transpose_7665" type="Permute">
			<data execOrder="185" execTimeMcs="not_executed" originalLayersNames="Transpose_7665" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Unsqueeze_7854" type="Reshape">
			<data execOrder="189" execTimeMcs="not_executed" originalLayersNames="Unsqueeze_7854" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Broadcast_7864" type="broadcast">
			<data execOrder="203" execTimeMcs="not_executed" originalLayersNames="Broadcast_7864,Multiply_138018" outputLayouts="bfzyx" outputPrecisions="f16" primitiveType="broadcast_gpu_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_7868" type="Reshape">
			<data execOrder="206" execTimeMcs="not_executed" originalLayersNames="Reshape_7868" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>4</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="ScaledDotProductAttention_7870" type="scaled_dot_product_attention">
			<data execOrder="207" execTimeMcs="not_executed" originalLayersNames="ScaledDotProductAttention_7870" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl::sdpa::opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Multiply_138023" type="Eltwise">
			<data execOrder="208" execTimeMcs="not_executed" originalLayersNames="Multiply_138023" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Transpose_7871" type="Permute">
			<data execOrder="209" execTimeMcs="not_executed" originalLayersNames="Transpose_7871" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Reshape_7873" type="Reshape">
			<data execOrder="210" execTimeMcs="not_executed" originalLayersNames="Reshape_7873" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="DynamicQuantize_140094" type="DynamicQuantize">
			<data execOrder="211" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_140094" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="MatMul_7874" type="FullyConnected">
			<data execOrder="212" execTimeMcs="not_executed" originalLayersNames="MatMul_7874,Add_7875" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="RMS_7876" type="rms">
			<data execOrder="213" execTimeMcs="not_executed" originalLayersNames="RMS_7876,MatMul_7877_scale_down" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="DynamicQuantize_140100" type="DynamicQuantize">
			<data execOrder="215" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_140100" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="DynamicQuantize_140106" type="DynamicQuantize">
			<data execOrder="214" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_140106" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="MatMul_7878" type="FullyConnected">
			<data execOrder="216" execTimeMcs="not_executed" originalLayersNames="MatMul_7878" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9728</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="MatMul_7877" type="FullyConnected">
			<data execOrder="217" execTimeMcs="not_executed" originalLayersNames="MatMul_7877,MatMul_7877_scale_up,Swish_7879,Multiply_7880_mm" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9728</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9728</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="DynamicQuantize_140112" type="DynamicQuantize">
			<data execOrder="218" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_140112" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9728</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9728</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9728</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="MatMul_7881" type="FullyConnected">
			<data execOrder="219" execTimeMcs="not_executed" originalLayersNames="MatMul_7881,Add_7882" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9728</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>9728</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="RMS_7883" type="rms">
			<data execOrder="220" execTimeMcs="not_executed" originalLayersNames="RMS_7883" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="MatMul_7885_scale_down" type="Eltwise">
			<data execOrder="221" execTimeMcs="not_executed" originalLayersNames="MatMul_7885_scale_down" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="generic_eltwise_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="DynamicQuantize_140118" type="DynamicQuantize">
			<data execOrder="223" execTimeMcs="not_executed" group_sizes="1, 1, -1" originalLayersNames="DynamicQuantize_140118" outputLayouts="bfyx" outputPrecisions="i8" primitiveType="dynamic_quantize_gpu_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="2" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="MatMul_7885" type="FullyConnected">
			<data execOrder="225" execTimeMcs="not_executed" originalLayersNames="MatMul_7885" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="i8" />
			<input>
				<port id="0" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
				<port id="1" precision="I8">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Reshape_7888" type="Reshape">
			<data execOrder="228" execTimeMcs="not_executed" originalLayersNames="Reshape_7888" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Transpose_7889" type="Permute">
			<data execOrder="231" execTimeMcs="not_executed" originalLayersNames="Transpose_7889" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>32</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="RMS_7894" type="rms">
			<data execOrder="234" execTimeMcs="not_executed" originalLayersNames="RMS_7894" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="rms_gpu_bfyx_opt__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="RoPE_8056" type="RoPE">
			<data execOrder="237" execTimeMcs="not_executed" originalLayersNames="RoPE_8056" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="ocl::rope::opt___f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Concat_7884" type="Concat">
